load-test/k6/results/test-1/30-min-ingestion-20-vus/insert-app_js_express_js.log

          /\      |‾‾| /‾‾/   /‾‾/   
     /\  /  \     |  |/  /   /  /    
    /  \/    \    |     (   /   ‾‾\  
   /          \   |  |\  \ |  (‾)  | 
  / __________ \  |__| \__\ \_____/ .io

     execution: local
        script: ./scripts/insert-app.js
        output: dashboard http://127.0.0.1:5665

     scenarios: (100.00%) 1 scenario, 20 max VUs, 30m30s max duration (incl. graceful stop):
              * default: 20 looping VUs for 30m0s (gracefulStop: 30s)


     _js_express_js.................: avg=12.602535 min=3.265  med=11.831  max=538.32   p(90)=16.275  p(95)=18.188 
     data_received..................: 780 MB  434 kB/s
     data_sent......................: 556 MB  309 kB/s
     http_req_blocked...............: avg=2.7µs     min=1µs    med=2µs     max=5.36ms   p(90)=3µs     p(95)=4µs    
     http_req_connecting............: avg=262ns     min=0s     med=0s      max=1.92ms   p(90)=0s      p(95)=0s     
     http_req_duration..............: avg=12.65ms   min=3.32ms med=11.88ms max=538.42ms p(90)=16.33ms p(95)=18.24ms
       { expected_response:true }...: avg=12.65ms   min=3.32ms med=11.88ms max=538.42ms p(90)=16.33ms p(95)=18.24ms
     http_req_failed................: 0.00%   ✓ 0           ✗ 2806707
     http_req_receiving.............: avg=40.82µs   min=15µs   med=36µs    max=56.68ms  p(90)=59µs    p(95)=69µs   
     http_req_sending...............: avg=16.62µs   min=5µs    med=15µs    max=44.87ms  p(90)=22µs    p(95)=24µs   
     http_req_tls_handshaking.......: avg=0s        min=0s     med=0s      max=0s       p(90)=0s      p(95)=0s     
     http_req_waiting...............: avg=12.6ms    min=3.26ms med=11.83ms max=538.32ms p(90)=16.27ms p(95)=18.18ms
     http_reqs......................: 2806707 1559.273278/s
     iteration_duration.............: avg=12.81ms   min=3.45ms med=12.03ms max=538.88ms p(90)=16.48ms p(95)=18.4ms 
     iterations.....................: 2806707 1559.273278/s
     vus............................: 20      min=20        max=20   
     vus_max........................: 20      min=20        max=20   


running (30m00.0s), 00/20 VUs, 2806707 complete and 0 interrupted iterations
default ✓ [ 100% ] 20 VUs  30m0s